# Отчет по лабораторной работе № 15
## по курсу "Прикладная математика и информатика"

Студент группы М8О-108Б-23 Нургалиев Даниэль Ильдарович

Работа выполнена 

Преподаватель: каф. 806 Севастьянов Виктор Сергеевич

1. **Тема**: Обработка квадратной матрицы в языке программирования C.
2. **Цель работы**: Написать программу на языке C, выполняющую обработку квадратной матрицы, вводимой из текстового файла, с последующей перестановкой элементов строки, содержащей минимальный элемент матрицы.
3. **Идея, метод, алгоритм решения задачи**:
- Открыть текстовый файл для чтения.
- Считать размер матрицы N.
- Выделить память под матрицу NxN.
- Считать элементы матрицы из файла.
- Найти минимальный элемент и его строку.
- Переставить элементы этой строки в обратном порядке.
- Вывести измененную матрицу.
4. **Сценарий выполнения работы**:
- Создать программу на языке C.
- Использовать стандартные функции для работы с файлами.
- Реализовать алгоритм перестановки элементов строки.
- Запустить программу, вводя имя файла входных данных.
5. **Протокол**:
```
#include <stdio.h>
#include <stdlib.h>

int main() {
    FILE* file = fopen("input.txt", "r");
    int min_val = 2147483647; 
    int min_row = -1;
    int n;

    fscanf(file, "%d", &n);
    int arr[n][n];


    for (int i = 0; i < n; i++) {
        for (int j = 0; j < n; j++) {
            fscanf(file, "%d", &arr[i][j]);
            if(arr[i][j] < min_val) {
                min_val = arr[i][j];
                min_row = i;
            }
        }
    }
    fclose(file);
    int start = 0;
    int end = n - 1;

    while (start < end) {
        int temp = arr[min_row][start];
        arr[min_row][start] = arr[min_row][end];
        arr[min_row][end] = temp;

        start++;
        end--;
    }

    for(int i = 0; i < n; i++) {
        for(int j = 0; j < n; j++) {
            printf("%d ", arr[i][j]);
        }
        printf("\n");
    }

    return 0;
}

```
6. **Выводы**: Эта работа была важной для развития навыков программирования на языке C и работы с файлами. Программа выполняет обработку квадратной матрицы, что может быть полезным в решении различных задач, например, анализе данных.

