# Отчет по лабораторной работе № 14
## по курсу "Прикладная математика и информатика"

Студент группы М8О-108Б-23 Нургалиев Даниэль Ильдарович

Работа выполнена 

Преподаватель: каф. 806 Севастьянов Виктор Сергеевич

1. **Тема**: Техника работы с числами. Система счисления.
2. **Цель работы**: Написать программу на языке C, которая определяет, есть ли одинаковые цифры в смежных разрядах.
3. **Идея, метод, алгоритм решения задачи**:
- Ввод чисел.
- Использование цилка while для обработки числа.
4. **Сценарий выполнения работы**:
- Написать программу на языке C.
- задать цикл while, который обрабатывает цифры числа.
- Скомпилировать и выполнить программу.
1. **Протокол**:
```
#include <stdio.h>
#include <stdlib.h>

int hasSameAdjacentDigits(int number) {
    number = abs(number);  // Применяем модуль для учета отрицательных чисел
    int prevDigit = number % 10;
    number /= 10;

    while (number > 0) {
        int currentDigit = number % 10;
        if (currentDigit == prevDigit) {
            return 1;
        }

        prevDigit = currentDigit;
        number /= 10;
    }

    return 0;
}

int main() {
    int inputNumber;

    while (scanf("%d", &inputNumber) != EOF) {
        int result = hasSameAdjacentDigits(inputNumber);

        if (result) {
            printf("yes\n");
        } else {
            printf("no\n");
        }
    }

    return 0;
}

```
6. **Выводы**: Эта работа была полезной для пониманиня потокового ввода\вывода.

