# Отчет по лабораторной работе № 14
## по курсу "Прикладная математика и информатика"

Студент группы М8О-108Б-23 Нургалиев Даниэль Ильдарович

Работа выполнена 

Преподаватель: каф. 806 Севастьянов Виктор Сергеевич

1. **Тема**: Вывод элементов квадратной матрицы в заданном порядке.
2. **Цель работы**: Написать программу на языке C для ввода квадратной матрицы и вывода ее элементов в определенном порядке.
3. **Идея, метод, алгоритм решения задачи**:
- Ввод квадратной матрицы.
- Использование вложенных циклов для обхода и вывода элементов в заданном порядке.
4. **Сценарий выполнения работы**:
- Написать программу на языке C.
- Задать размерность квадратной матрицы и ввести ее элементы.
- Использовать вложенные циклы для вывода элементов в указанном порядке.
- Скомпилировать и выполнить программу.
5. **Протокол**:
```
#include <stdio.h>

int main() {
    int matrix[7][7];
    int n;
    scanf("%d", &n);
    if (n == 0) {
        return 0;
    }
    for (int i = 0; i < n; i++) {
        for (int j = 0; j < n; j++) {
            scanf("%d", &matrix[i][j]);
        }
    }

    int rot = 0;
    int vert2 = n-1;
    int hor2 = n-1;

    int vert = n-1;
    int vert3;
    int hor3;
    int ii;
    int loop = 0;
    printf("%d ", matrix[vert2][hor2]);
    int prints = 1;
    // (；￣Д￣)
    while (loop <= n) {
        loop++;
        if (prints == n*n) {
            return 0;
        }
        if (rot == 0) {
            printf("%d ", matrix[vert-1][vert2]);
            prints++;
            if (prints == n*n) {
                return 0;
            }
            vert3 = vert - 1;
            for (int i = 1; i <= loop; i++) {
                printf("%d ", matrix[vert3][hor2-i]);
                prints++;
                if (prints == n*n) {
                    return 0;
                }
                hor3 = hor2-i;
            }
            for (int i = 1; i <= loop; i++) {
                printf("%d ", matrix[vert3+i][hor3]);
                prints++;
                if (prints == n*n) {
                    return 0;
                }
                ii = i;
            }
            printf("%d ", matrix[vert3+ii][hor3-1]);
            prints++;
            if (prints == n*n) {
                return 0;
            }
            rot = 1;
        } else {
            for (int i = 0; i <= loop-1; i++) {
                printf("%d ", matrix[vert3-i+loop-2][hor3-1]);
                prints++;
                if (prints == n*n) {
                    return 0;
                }
                vert = vert3-i+loop-2;
            }
            for (int i = 1; i <= loop; i++) {
                printf("%d ", matrix[vert][hor3-1+i]);
                prints++;
                if (prints == n*n) {
                    return 0;
                }
            }
            rot = 0;
        }
    }

    return 0;
}

```
6. **Выводы**: Эта работа была полезной для понимания применения вложенных циклов при обработке квадратной матрицы на языке C. В результате выполнения работы была разработана программа, способная вводить и выводить элементы матрицы в указанном порядке, что может быть полезным при решении подобных задач.

